---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.WorkshopInstructions
source: html/767b1bab-6fc4-92b1-3caa-0090c83faccb.htm
---
# Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.WorkshopInstructions Property

Identifies the workshop instructions of the current Rebar element.

## Syntax (C#)
```csharp
public RebarWorkInstructions WorkshopInstructions { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration